from evaluation import *
from evaluation.calculate import *

indexs = {
    # 宽基
    '000985.CSI' : '中证全指',
    '000300.SH' : '沪深300',
    '000905.SH' : '中证500',
    '000016.SH' : '上证50',
    '399006.SZ' : '创业板指',
    '399673.SZ' : '创业板50',
    '000688.SH' : '科创50',
    '000922.CSI' : '中证红利',

    # 一级行业
    '000986.SH' : '全指能源',
    '000987.SH' : '全指材料',
    '000988.CSI' : '全指工业',
    '000989.SH' : '全指可选',
    '000990.CSI' : '全指消费',
    '000991.SH' : '全指医药',
    '000993.SH' : '全指信息',
    '000994.CSI' : '全指通信',
    '000995.CSI' : '全指公用',
    '931775.CSI' : '中证全指房地产',

    # 其他
    '399989.SZ' : '中证医疗',
    '000827.SH' : '中证环保',
    '930697.CSI' : '家用电器',
    '930653.CSI' : '中证食品饮料',
    '399971.SZ' : '中证传媒',

    # 海外
    'HSI.HI' : '恒生指数',
    'HSTECH.HI' : '恒生科技',
    'HSHCI' : '恒生医疗保健',
    'IXIC.GI' : '纳斯达克指数',
    'SPX.GI' : '标普500',
    'NDX.GI' : '纳斯达克100',
}

for index in indexs:
    update_to_lastest(index)