from evaluation import *

import datetime

indexs = {
    # 宽基
    '000985.CSI' : '中证全指',
    '000300.SH' : '沪深300',
    '000905.SH' : '中证500',
    '000016.SH' : '上证50',
    '399006.SZ' : '创业板指',
    '399673.SZ' : '创业板50',
    '000688.SH' : '科创50',
    '000922.CSI' : '中证红利',

    # 一级行业
    '000986.SH' : '全指能源',
    '000987.SH' : '全指材料',
    '000988.CSI' : '全指工业',
    '000989.SH' : '全指可选',
    '000990.CSI' : '全指消费',
    '000991.SH' : '全指医药',
    '000993.SH' : '全指信息',
    '000994.CSI' : '全指通信',
    '000995.CSI' : '全指公用',
    '931775.CSI' : '中证全指房地产',

    # 其他行业
    '399989.SZ' : '中证医疗',
    '000808.CSI' : '医药生物',
    '000978.CSI' : '医药100',
    '930641.CSI' : '中证中药',
    '931152.CSI' : 'CS创新药',
    '000827.SH' : '中证环保',
    '930653.CSI' : '中证食品饮料',
    '399971.SZ' : '中证传媒',
    '930608.CSI' : '中证基建',
    '399967.SZ' : '中证军工',
    '931144.CSI' : '通信技术',
    '399998.SZ' : '中证煤炭',
    '399975.SZ' : '证券公司',
    '931186.CSI' : '中证科技',
    '930651.CSI' : 'CS计算机',
    '930652.CSI' : 'CS电子',
    '399986.SZ' : '中证银行',
    '990001.CSI' : '中华半导体芯片',

    # 其他主题
    '930697.CSI' : '家用电器',
    '931151.CSI' : '光伏产业',
    '931719.CSI' : 'CS电池',
    '399808.SZ' : '中证新能',
    '930599.CSI' : '中证高装',
    '930838.CSI' : 'CS高股息',
    '399997.SZ' : '中证白酒',
    'H30597.CSI' : '新材料',
    '399812.SZ' : '养老产业',
    '930743.CSI' : '中证生科',
    '931071.CSI' : '人工智能',

    # 海外
    'HSI.HI' : '恒生指数',
    'HSTECH.HI' : '恒生科技',
    'HSHCI.HI' : '恒生医疗保健',
    'DJI.GI' : '道琼斯工业指数',
    'SPX.GI' : '标普500',
    'IXIC.GI' : '纳斯达克指数',
    'NDX.GI' : '纳斯达克100',
    'NBI.GI' : '纳斯达克生物技术',
    'FTSE.GI' : '英国富时100',
    'GDAXI.GI' : '德国DAX',
    'N225.GI' : '日经225',
    'FCHI.GI' : '法国CAC40',
    'SENSEX.GI' : '印度SENSEX30',
}

# for index in indexs:
#     update_to_lastest(index)

for index in indexs:
    local_recalculate(index, 'day')